{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "img_in",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        120,
                        160,
                        3
                    ],
                    "dtype": "float32",
                    "name": "img_in",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "img_in"
            },
            {
                "class_name": "Cropping2D",
                "config": {
                    "cropping": [
                        [
                            0,
                            0
                        ],
                        [
                            0,
                            0
                        ]
                    ],
                    "data_format": "channels_last",
                    "name": "cropping2d_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "img_in",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "cropping2d_1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "cropping2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 24,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "name": "conv2d_1",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_1"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "name": "conv2d_2",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_2"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_2"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "name": "conv2d_3",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_3"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_3",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_3"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_4",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_4"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_4",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_4"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_5",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_5"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_5",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_5"
            },
            {
                "class_name": "Flatten",
                "config": {
                    "data_format": "channels_last",
                    "name": "flattened",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "flattened"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_1",
                    "trainable": true,
                    "units": 100,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "flattened",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_1"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_6",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_6"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_2",
                    "trainable": true,
                    "units": 50,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_2"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_7",
                    "noise_shape": null,
                    "rate": 0.1,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_7"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "n_outputs0",
                    "trainable": true,
                    "units": 1,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "n_outputs0"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "n_outputs1",
                    "trainable": true,
                    "units": 1,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "n_outputs1"
            }
        ],
        "name": "model_1",
        "output_layers": [
            [
                "n_outputs0",
                0,
                0
            ],
            [
                "n_outputs1",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.2"
}